{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_19_input"}}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "batch_input_shape": [null, 14], "dtype": "float32", "units": 32, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 16, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 6, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 6, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "mean_absolute_error", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mae", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_12/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_15/gamma", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [6], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [6], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [14, 32], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [16, 6], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [6], "dtype": "float32"}, {"name": "dense_22/kernel", "shape": [6, 6], "dtype": "float32"}, {"name": "dense_22/bias", "shape": [6], "dtype": "float32"}, {"name": "dense_23/kernel", "shape": [6, 1], "dtype": "float32"}, {"name": "dense_23/bias", "shape": [1], "dtype": "float32"}]}]}